chefsbrigade/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("FirstName", "LastName", "UserName", "Num_Meals", "Allergies", "Pickup_Date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)