chefsbrigade/app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("r_id", "name", "address", "phone", "email", "created_at", "updated_at", "description", "picture_link") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "name" = ?, "description" = ?, "picture_link" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", ""], ["description", ""], ["picture_link", ""], ["updated_at", "2021-10-19 02:15:35.569439"], ["id", 10]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]